Public Attributes | List of all members
API_NoteType Struct Reference
Element Manager API
Describes a general note, used in dimensioning and hatch text. More...
#include <APIdefs_Elements.h>
 Public Attributes
short  | notePen
Pen attribute index.
short  | noteFont
Font attribute index.
API_AttributeIndex  | noteLayer
Layer attribute index.
double  | noteSize
The character height in mm.
double  | noteAngle
Rotation angle in radian.
API_Coord  | pos
Coordinates of left bottom.
char  | content [64]
The text or the autotext of the note.
GS::UniString *  | contentUStr
Optional parameter for accessing the text or the autotext of the note in UniString format.
API_NoteContentType  | contentType
0: measured value 1: custom text
bool  | fixPos
Is the position of the note manually fixed?
unsigned short  | faceBits
The style of the note:
bool  | opaque
The note has background.
bool  | frame
The note has frame.
short  | backgroundPen
The background color index if opaque.
short  | framePen
Frame color index if framed.
bool  | useLeaderLine
Whether the note has leader line.
bool  | anchorAtTextEnd
Whether the leader line attached to the end of the note text.
API_Coord  | begC
Beginning coordinate of the leader line.
API_Coord  | midC
Middle coordinate of the leader line.
API_Coord  | endC
End coordinate of the leader line.
short  | leaderPen
Leader line pen attribute index.
API_AttributeIndex  | leaderLineType
Line type attribute index of the leader line.
API_LeaderLineShapeID  | leaderShape
Shape of the leader line.
API_ArrowData  | arrowData
The arrow type. See API_ArrowData.
API_LblAnchorID  | anchorPoint
Anchor point the pointer line is connected to. See API_LblAnchorID.
API_JustID  | just
Multiline Text alignment (Left, Center, Right).
double  | widthFactor
Width scale of the note's text.
double  | spacingFactor
Spacing scale of the note's text.
short  | rowAnchor
Text anchor row (First = 0, or Last Row = 1).
unsigned short  | effectBits
Special text effects:
Detailed Description
Describes a general note, used in dimensioning and hatch text.
Remarks
This type is used in many as text blocks of any kind of dimensions. You can only create notes with leader line on angle dimensions, floor plan dimensions and hatches. If you want to create a note with leaderline you will have to set fixpos to true, but you do not have to calculate pos and noteAngle because leaderline will determine these automatically. subContent is removed in API 14.
Member Data Documentation
◆ anchorAtTextEnd
 API_NoteType::anchorAtTextEnd
Whether the leader line attached to the end of the note text.
◆ anchorPoint
 API_NoteType::anchorPoint
Anchor point the pointer line is connected to. See API_LblAnchorID.
◆ arrowData
 API_NoteType::arrowData
The arrow type. See API_ArrowData.
◆ backgroundPen
 API_NoteType::backgroundPen
The background color index if opaque.
◆ begC
 API_NoteType::begC
Beginning coordinate of the leader line.
◆ content
 API_NoteType::content
The text or the autotext of the note.
◆ contentType
 API_NoteType::contentType
0: measured value 1: custom text
◆ contentUStr
 API_NoteType::contentUStr
Optional parameter for accessing the text or the autotext of the note in UniString format.
◆ effectBits
 API_NoteType::effectBits
Special text effects:
 Effect  | Style
 APIEffect_StrikeOut  | Strikethrough text
 APIEffect_SuperScript  | Superscript
 APIEffect_SubScript  | Subscript
 APIEffect_Protected  | Protected text (autotext reference)
◆ endC
 API_NoteType::endC
End coordinate of the leader line.
◆ faceBits
 API_NoteType::faceBits
The style of the note:
 Bit  | Style
 APIFace_Plain  | Plain text
 APIFace_Bold  | Bold
 APIFace_Italic  | Italic
 APIFace_Underline  | Underline
◆ fixPos
 API_NoteType::fixPos
Is the position of the note manually fixed?
◆ frame
 API_NoteType::frame
The note has frame.
◆ framePen
 API_NoteType::framePen
Frame color index if framed.
◆ just
 API_NoteType::just
Multiline Text alignment (Left, Center, Right).
◆ leaderLineType
 API_NoteType::leaderLineType
Line type attribute index of the leader line.
◆ leaderPen
 API_NoteType::leaderPen
Leader line pen attribute index.
◆ leaderShape
 API_NoteType::leaderShape
Shape of the leader line.
◆ midC
 API_NoteType::midC
Middle coordinate of the leader line.
◆ noteAngle
 API_NoteType::noteAngle
Rotation angle in radian.
◆ noteFont
 API_NoteType::noteFont
Font attribute index.
◆ noteLayer
 API_NoteType::noteLayer
Layer attribute index.
◆ notePen
 API_NoteType::notePen
Pen attribute index.
◆ noteSize
 API_NoteType::noteSize
The character height in mm.
◆ opaque
 API_NoteType::opaque
The note has background.
◆ pos
 API_NoteType::pos
Coordinates of left bottom.
◆ rowAnchor
 API_NoteType::rowAnchor
Text anchor row (First = 0, or Last Row = 1).
◆ spacingFactor
 API_NoteType::spacingFactor
Spacing scale of the note's text.
◆ useLeaderLine
 API_NoteType::useLeaderLine
Whether the note has leader line.
◆ widthFactor
 API_NoteType::widthFactor
Width scale of the note's text.